In [60]:
import pandas as pd
import numpy as np


df1 = pd.DataFrame({'a': [1, np.nan,5,np.nan],
                'b': [np.nan,2,np.nan,6],
                'c': range(2,18,4) })

df2 = pd.DataFrame({'a': [5,4, np.nan,3,7],
                'b': [np.nan,3,4,6,8] })

In [61]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [62]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [63]:
df2.combine_first(df1)

     a    b     c
0  5.0  NaN   2.0
1  4.0  3.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [64]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [65]:
columns_to_drop = ['Edition Statement',
                       'Corporate Author',
                       'Corporate Contributors',
                       'Former owner',
                       'Engraver',
                       'Contributors',
                       'Issuance type',
                       'Shelfmarks'
                       ]
csv_file = 'Books.csv'
df = pd.read_csv(csv_file)

# drop unneccessary columns
df.drop(columns_to_drop, inplace=True, axis=1)

# clean the date of publication & convert it to numeric data
new_date = df['Date of Publication'].str.extract(r'^(\d{4})', expand=False)
new_date = pd.to_numeric(new_date)
new_date = new_date.fillna(0)
df['Date of Publication'] = new_date

# replace spaces in the name of columns
df.columns = [c.replace(' ', '_') for c in df.columns]

# set the index column; this will help us to find books with their ids
df.set_index('Identifier', inplace=True)

In [66]:
new_date

0     1879.0
1     1868.0
2     1869.0
3     1851.0
4     1857.0
5     1875.0
6     1872.0
7        0.0
8     1676.0
9     1676.0
10    1802.0
11    1859.0
12    1888.0
13    1676.0
14    1888.0
15    1888.0
16    1860.0
17    1873.0
18    1866.0
19    1899.0
Name: Date of Publication, dtype: float64

In [67]:
df.index

Int64Index([ 206,  216,  218,  472,  480,  481,  519,  667,  874, 1143, 1280,
            1808, 1905, 1929, 2836, 2854, 2956, 2957, 3017, 3131],
           dtype='int64', name='Identifier')

In [68]:
df.reset_index(inplace=True)

In [ ]:
import requests

resp = requests.get("http://api.worldbank.org/v2/countries/all/indicators/NY.GDP.MKTP.CD?date=2012:2017&format=json&per_page=1000")

In [ ]:
print(resp)